*** Database migration
#+NAME: database-migration
#+BEGIN_SRC shell
docker run --rm \
    --net oidc-example-bridge \
    --link kong-database:kong-database \
    -e "KONG_DATABASE=cassandra" \
    -e "KONG_CASSANDRA_CONTACT_POINTS=kong-database" \
    kong-oidc:latest kong migrations up
#+END_SRC

#+RESULTS: database-migration
| migrating             | core                  | for        | keyspace | kong                                              |          |             |
| core                  | migrated              | up         | to:      | 2015-01-12-175310_skeleton                        |          |             |
| core                  | migrated              | up         | to:      | 2015-01-12-175310_init_schema                     |          |             |
| core                  | migrated              | up         | to:      | 2015-11-23-817313_nodes                           |          |             |
| core                  | migrated              | up         | to:      | 2016-02-25-160900_remove_null_consumer_id         |          |             |
| core                  | migrated              | up         | to:      | 2016-02-29-121813_remove_ttls                     |          |             |
| core                  | migrated              | up         | to:      | 2016-09-05-212515_retries_step_1                  |          |             |
| core                  | migrated              | up         | to:      | 2016-09-05-212515_retries_step_2                  |          |             |
| core                  | migrated              | up         | to:      | 2016-09-16-141423_upstreams                       |          |             |
| core                  | migrated              | up         | to:      | 2016-12-14-172100_move_ssl_certs_to_core          |          |             |
| core                  | migrated              | up         | to:      | 2016-11-11-151900_new_apis_router_1               |          |             |
| core                  | migrated              | up         | to:      | 2016-11-11-151900_new_apis_router_2               |          |             |
| core                  | migrated              | up         | to:      | 2016-11-11-151900_new_apis_router_3               |          |             |
| core                  | migrated              | up         | to:      | 2017-01-24-132600_upstream_timeouts               |          |             |
| core                  | migrated              | up         | to:      | 2017-01-24-132600_upstream_timeouts_2             |          |             |
| core                  | migrated              | up         | to:      | 2017-03-27-132300_anonymous                       |          |             |
| core                  | migrated              | up         | to:      | 2017-04-04-145100_cluster_events                  |          |             |
| core                  | migrated              | up         | to:      | 2017-05-19-173100_remove_nodes_table              |          |             |
| migrating             | response-transformer  | for        | keyspace | kong                                              |          |             |
| response-transformer  | migrated              | up         | to:      | 2016-03-10-160000_resp_trans_schema_changes       |          |             |
| migrating             | rate-limiting         | for        | keyspace | kong                                              |          |             |
| rate-limiting         | migrated              | up         | to:      | 2015-08-03-132400_init_ratelimiting               |          |             |
| rate-limiting         | migrated              | up         | to:      | 2016-07-25-471385_ratelimiting_policies           |          |             |
| migrating             | acl                   | for        | keyspace | kong                                              |          |             |
| acl                   | migrated              | up         | to:      | 2015-08-25-841841_init_acl                        |          |             |
| migrating             | ip-restriction        | for        | keyspace | kong                                              |          |             |
| ip-restriction        | migrated              | up         | to:      | 2016-05-24-remove-cache                           |          |             |
| migrating             | statsd                | for        | keyspace | kong                                              |          |             |
| statsd                | migrated              | up         | to:      | 2017-06-09-160000_statsd_schema_changes           |          |             |
| migrating             | jwt                   | for        | keyspace | kong                                              |          |             |
| jwt                   | migrated              | up         | to:      | 2015-06-09-jwt-auth                               |          |             |
| jwt                   | migrated              | up         | to:      | 2016-03-07-jwt-alg                                |          |             |
| migrating             | cors                  | for        | keyspace | kong                                              |          |             |
| cors                  | migrated              | up         | to:      | 2017-03-14_multiple_orgins                        |          |             |
| migrating             | galileo               | for        | keyspace | kong                                              |          |             |
| galileo               | migrated              | up         | to:      | 2016-04-15_galileo-import-mashape-analytics       |          |             |
| migrating             | basic-auth            | for        | keyspace | kong                                              |          |             |
| basic-auth            | migrated              | up         | to:      | 2015-08-03-132400_init_basicauth                  |          |             |
| migrating             | key-auth              | for        | keyspace | kong                                              |          |             |
| key-auth              | migrated              | up         | to:      | 2015-07-31-172400_init_keyauth                    |          |             |
| migrating             | response-ratelimiting | for        | keyspace | kong                                              |          |             |
| response-ratelimiting | migrated              | up         | to:      | 2015-08-21_init_response-rate-limiting            |          |             |
| response-ratelimiting | migrated              | up         | to:      | 2016-08-04-321512_response-rate-limiting_policies |          |             |
| migrating             | request-transformer   | for        | keyspace | kong                                              |          |             |
| request-transformer   | migrated              | up         | to:      | 2016-03-10-160000_req_trans_schema_changes        |          |             |
| migrating             | datadog               | for        | keyspace | kong                                              |          |             |
| datadog               | migrated              | up         | to:      | 2017-06-09-160000_datadog_schema_changes          |          |             |
| migrating             | hmac-auth             | for        | keyspace | kong                                              |          |             |
| hmac-auth             | migrated              | up         | to:      | 2015-09-16-132400_init_hmacauth                   |          |             |
| hmac-auth             | migrated              | up         | to:      | 2017-06-21-132400_init_hmacauth                   |          |             |
| migrating             | oauth2                | for        | keyspace | kong                                              |          |             |
| oauth2                | migrated              | up         | to:      | 2015-08-03-132400_init_oauth2                     |          |             |
| oauth2                | migrated              | up         | to:      | 2015-08-24-215800_cascade_delete_index            |          |             |
| oauth2                | migrated              | up         | to:      | 2016-02-29-435612_remove_ttl                      |          |             |
| oauth2                | migrated              | up         | to:      | 2016-04-14-283949_serialize_redirect_uri          |          |             |
| oauth2                | migrated              | up         | to:      | 2016-07-15-oauth2_code_credential_id              |          |             |
| oauth2                | migrated              | up         | to:      | 2016-09-19-oauth2_code_index                      |          |             |
| oauth2                | migrated              | up         | to:      | 2016-09-19-oauth2_api_id                          |          |             |
| oauth2                | migrated              | up         | to:      | 2016-12-15-set_global_credentials                 |          |             |
| 43                    | migrations            | ran        |          |                                                   |          |             |
| waiting               | for                   | Cassandra  | schema   | consensus                                         | (10000ms | timeout)... |
| Cassandra             | schema                | consensus: | reached  |                                                   |          |             |
**** GET

#+NAME: get oidc-secure
#+BEGIN_SRC shell
http GET localhost:8001/apis/oidc-secure
#+END_SRC

#+RESULTS: get oidc-secure
| <html>                                  |             |       |                     |
| <head><title>415                        | Unsupported | Media | Type</title></head> |
| <body                                   | white       |       |                     |
| <center><h1>415                         | Unsupported | Media | Type</h1></center>  |
| <hr><center>openresty/1.11.2.4</center> |             |       |                     |
| </body>                                 |             |       |                     |
| </html>                                 |             |       |                     |
